第二轮测试截图/WATR00汕头水费/汕头水费联机欠费查询-测试数据.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.GDEUPSWATR00Service/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">
   <soapenv:Body>
      <sch:queryThirdFeeOffChan>
         <gsp:requestInformation>
            <gsp:traceNo>2004440320150305113500000100</gsp:traceNo>
            <gsp:version>1.0</gsp:version>
         </gsp:requestInformation>
         <sch:request>
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <bbip:chn>00</bbip:chn>
                  <bbip:reqJrnNo>2004440320150305113500000100</bbip:reqJrnNo>
                  <bbip:tlr>4411234</bbip:tlr>
                  <bbip:br>01441101001</bbip:br>
                  <bbip:bk>441999</bbip:bk>
                  <bbip:tlrTmlId>441101A</bbip:tlrTmlId>
                  <bbip:reqTme>2015-02-12T12:12:12</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
            <sch:eupsBusTyp>WATR00</sch:eupsBusTyp>
            <sch:thdCusNo>123</sch:thdCusNo>
         </sch:request>
      </sch:queryThirdFeeOffChan>
   </soapenv:Body>
</soapenv:Envelope>